function generateYearsArray() {
  const lastYear = 1940;
  const startYear = new Date().getFullYear();

  return Array.from(
    { length: startYear - lastYear + 1 },
    (_, i) => startYear - i
  );
}

export const years = generateYearsArray();
export const countries = [
  "Австралія",
  "Австрія",
  "Велика Британія",
  "Великобританія",
  "Гонконг",
  "Ізраїль",
  "Індонезія",
  "Ірландія",
  "Іспанія",
  "Італія",
  "Канада",
  "Китай",
  "Мексика",
  "Німеччина",
  "Нова Зеландія",
  "Південна Корея",
  "Польща",
  "Росія",
  "СРСР",
  "США",
  "Туреччина",
  "Угорщина",
  "Україна",
  "Фінляндія",
  "Франція",
];
export const directors = [
  "Адам Бернштейн",
  "Алан Тейлор",
  "Алекс Грейвз",
  "Вінс Гілліган",
  "Гарі Хелворсон",
  "Гійом Кане",
  "Грег Нікотеро",
  "Девід Бойд",
  "Девід Наттер",
  "Джеймс Берроуз",
  "Джон Уеллс",
  "Ернест Р. Дікерсон",
  "Ерос Лін",
  "Ієн Б. МакДональд",
  "Кевін Брайт",
  "Кокі Гідройч",
  "Колін Баксі",
  "Колін Вест",
  "Крістофер Чулак",
  "Майкл Є. Сатраземіс",
  "Майкл Лембек",
  "Майкл Поліш",
  "Марк Майлод",
  "Мігель Сапочник",
  "Мішель МакЛарен",
  "Нік Харран",
  "Пейтон Рід",
  "Пол Макгіган",
  "Райан Уайт",
];
